Repository: 84000/data-translation-memory
Catalog: Toh_152-The_Questions_of_Sagaramati-v2.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ལ་བརྩོན་པའི་སྟོབས་ཀྱིས་རྣམ་པར་གནོན་པ་དང་།
en: (3) being humbled by the power of striving to perfect all buddha qualities, and

source: འཁོར་བ་དཔག་ཏུ་མེད་པ་ཡོངས་སུ་འཛིན་པ་ལ་ཡོངས་སུ་མི་སྐྱོ་བར་བརྩོན་པས་བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་སོགས་པ་སྟེ།
en: (4) gathering the accumulations of merit and wisdom without tiring in their embrace of limitless saṃsāra.

source: རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན། བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པ་རྣམས་ཞེས་བྱའོ། །
en: Great King, if bodhisattva great beings have these four qualities, they are called true bodhisattvas.’

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལྟར་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་སྣང་བ་མཐའ་ཡས་དེས་བཞི་པ་བསྒྲུབ་པ་བསྟན་པ་འདི་བཤད་པ་ན། སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་བཅུས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: “Sāgaramati, when the blessed thus-gone Infinite Light gave this teaching on the fourfold achievements, eight hundred billion beings developed the mind directed toward unsurpassed and perfect awakening,

source: དགེ་སློང་བྱེ་བ་ཕྲག་བརྒྱད་ལེན་པ་མེད་པས་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ། །
en: and the minds of eighty million monks were liberated from defilement with no further grasping.

source: རྒྱལ་བུ་གཞོན་ནུ་དེ་དག་དང་། རྒྱལ་པོའི་བུ་མོ་རྣམས་དང་། རྒྱལ་པོའི་བཙུན་མོའི་འཁོར་ནི་ཆུང་ངུའི་རྗེས་སུ་འཐུན་པའི་ཆོས་ལ་བཟོད་པ་སྐྱེས་སོ། །
en: The princes, princesses, and queens developed the lesser acceptance of phenomena concurring with reality.

source: རྒྱལ་པོ་ཆེན་པོ་ཡུལ་ཤིན་ཏུ་རྣམ་པར་དག་པ་ནི་རྣོ་བའི་རྗེས་སུ་འཐུན་པའི་ཆོས་ལ་བཟོད་པ་སྐྱེས་སོ། །
en: The great king Pure Domain himself developed the sharper acceptance of phenomena concurring with reality.

source: དེ་ནས་རྒྱལ་པོ་ཡུལ་ཤིན་ཏུ་རྣམ་པར་དག་པ་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཤིང་རབ་ཏུ་དགའ་སྟེ་
en: The king was satisfied, happy, delighted, and joyful.

source: དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས་རྒྱལ་སྲིད་ཐམས་ཅད་བཅོམ་ལྡན་འདས་དེ་ལ་ཡོངས་སུ་སྤྱད་པའི་ཕྱིར་ཕུལ་ལོ།། །།
en: With such joy and happiness, he offered the entirety of his dominion to the Blessed One for his use.

source: འཕགས་པ་བློ་གྲོས་རྒྱ་མཚོས་ཞུས་པ། བམ་པོ་དགུ་པ། བློ་གྲོས་རྒྱ་མཚོ་དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་སྣང་བ་མཐའ་ཡས་དེས་རྒྱལ་པོ་ཡུལ་ཤིན་ཏུ་རྣམ་པར་དག་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: “Then, Sāgaramati, the blessed thus-gone Infinite Light commanded King Pure Domain,

source: རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་ཡོངས་སུ་སྤྱད་པའི་ཕྱིར་རྒྱལ་སྲིད་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པ་ལ་ཕུལ་ཟིན་ན། རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་དད་པས་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ཤིག །
en: ‘Great King, given that you have now offered your entire dominion to the Thus-Gone One for his use, you should leave your home and faithfully go forth in the well-spoken Dharma-Vinaya.

source: རྒྱལ་པོ་ཆེན་པོ་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་བྱུང་བ་ནི་དོན་ཆེ་བ་ཕན་ཡོན་ཆེ་བ་རྒྱ་ཆེ་བའོ། །
en: Great King, going forth in the well-spoken Dharma-Vinaya is more meaningful and beneficial.

source: རྒྱལ་པོ་ཆེན་པོ་རབ་ཏུ་བྱུང་བར་གཏོགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་འཐོབ་པ་ཆེན་པོ་ནི་ཉི་ཤུ་པོ་འདི་དག་སྟེ། ཐམས་ཅད་མཁྱེན་པ་བླ་ན་མེད་པའི་འཐོབ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་དག་གོ། །
en: Great King, there are twenty great achievements of bodhisattvas who have gone forth that perfect the unsurpassed attainment of omniscience.

source: ཉི་ཤུ་པོ་དེ་གང་ཞེ་ན།
en: What are they?

source: འདི་ལྟ་སྟེ། རྒྱལ་སྲིད་དང་ལོངས་སྤྱོད་དང་གཡོག་འཁོར་དང་དབང་ཕྱུག་འདོར་བས་ང་ཡི་བ་མེད་ཅིང་ཡོངས་སུ་འཛིན་པ་མེད་པ་འཐོབ་པ་དང་།
en: (1) The achievement of giving up one’s dominion, wealth, servants, and power so that they are not thought of as “mine” or grasped for.

source: ཁྱིམ་ནས་འབྱུང་བ་ལ་གཞོལ་བས་ཉོན་མོངས་པ་ལས་བྱུང་བ་འཐོབ་པ་དང་།
en: (2) The achievement of escaping the afflictions due to the leaving the household life.

source: ངུར་སྨྲིག་འཛིན་པས་རྙོག་པ་མེད་པའི་སེམས་འཐོབ་པ་དང་།
en: (3) The achievement of a limpid mind through donning the saffron robes.

source: འཕགས་པའི་རིགས་ཆོག་ཤེས་པས་དགང་སླ་བ་དང་། གསོ་སླ་བ་འཐོབ་པ་དང་།
en: (4) The achievement of being easily satisfied and having few requirements out of the contentment of belonging to the noble lineage.

source: སྦྱངས་པའི་ཡོན་ཏན་ཡོ་བྱད་བསྙུངས་པ་ཡང་དག་པར་ལེན་པས་འདོད་པ་ཆེ་བ་དང་སྡིག་པ་འདོད་པ་སྤོང་བ་འཐོབ་པ་དང་།
en: (5) The achievement of abandoning great desire, and desire for evil deeds, due to taking up the ascetic practices and a having few possessions.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ཡོངས་སུ་དག་པས་ལྷ་དང་མིར་སྐྱེ་བ་འཐོབ་པ་དང་།
en: (6) The achievement of rebirth as a human or god due to maintaining pure discipline.

source: བྱང་ཆུབ་ཀྱི་སེམས་མི་འདོར་བས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་འཐོབ་པ་དང་།
en: (7) The achievement of the six perfections due to not giving up the mind of awakening.

source: དགོན་པ་དབེན་པ་ན་གནས་པས་འདུ་འཛི་དང་མི་འདྲེ་བ་འཐོབ་པ་དང་།
en: (8) The achievement of independence from distractions due to living in remote wilderness.

source: གནོད་པ་མེད་པས་ཆོས་སེམས་པའི་བདེ་བ་འཐོབ་པ་དང་།
en: (9) The achievement of the happiness of a religious mind that comes from doing no harm.

source: བསམ་གཏན་གྱི་ཡན་ལག་ཡང་དག་པར་བསྒྲུབས་པས་སེམས་ལས་སུ་རུང་བ་འཐོབ་པ་དང་།
en: (10) The achievement of mental pliancy that comes from accomplishing the branches of concentration.

source: ཐོས་པ་ཡོངས་སུ་ཚོལ་བས་ཤེས་རབ་ཆེན་པོ་འཐོབ་པ་དང་།
en: (11) The achievement of great insight through the pursuit of learning.

source: ང་རྒྱལ་མེད་པས་ཡེ་ཤེས་ཆེན་པོ་འཐོབ་པ་དང་།
en: (12) The achievement of great wisdom due to giving up pride.

source: དོན་ཉུང་ཞིང་བྱེད་པ་ཉུང་བས་ཆོས་རབ་ཏུ་རྣམ་པར་འབྱེད་པ་འཐོབ་པ་དང་།
en: (13) The achievement of discriminating among phenomena due to having few aims and activities.

source: སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་མཉམ་པ་ཉིད་པས་བྱམས་པ་ཆེན་པོ་འཐོབ་པ་དང་།
en: (14) The achievement of great love due to having an unbiased mind toward all beings.

source: སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་ཐར་བར་བྱེད་པའི་སེམས་ཀྱིས་སྙིང་རྗེ་ཆེན་པོ་འཐོབ་པ་དང་།
en: (15) The achievement of great compassion due to the intention to free all beings.

source: ལུས་དང་སྲོག་ལ་མི་ལྟ་བས་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་འཐོབ་པ་དང་།
en: (16) The achievement of upholding the sublime Dharma without regard for one’s life and limb.

source: སེམས་རབ་ཏུ་སྦྱངས་པས་མངོན་པར་ཤེས་པ་ཆེན་པོ་འཐོབ་པ་དང་།
en: (17) The achievement of great super-knowledge by thoroughly training the mind.

source: སངས་རྒྱས་རྗེས་སུ་དྲན་པས་སངས་རྒྱས་མཐོང་བ་འཐོབ་པ་དང་།
en: (18) The achievement of seeing the buddhas through the recollection of the buddhas.

source: ཚུལ་བཞིན་གྱིས་ཆོས་ལ་སོ་སོར་རྟོག་པས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པ་འཐོབ་པ་དང་།
en: (19) The achievement of the acceptance that phenomena are unborn due to accurately discerning phenomena.

source: ཡོན་ཏན་ཐམས་ཅད་ཡང་དག་པར་འཛིན་པའི་སྤྱོད་པས་མྱུར་དུ་ཐམས་ཅད་མཁྱེན་པ་ཐོབ་པ་འཐོབ་པ་སྟེ།
en: (20) The achievement of swift omniscience due to the conduct that upholds all qualities.

source: རྒྱལ་པོ་ཆེན་པོ་རབ་ཏུ་བྱུང་བར་གཏོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་འཐོབ་པ་ཆེན་པོ་ཉི་ཤུ་པོ་འདི་དག་རྙེད་པར་དཀའ་བར་མི་འགྱུར་རོ། །
en: Great King, these twenty achievements are not difficult to gain for bodhisattvas among the ordained.

source: རྒྱལ་པོ་ཆེན་པོ་དེ་ལྟ་བས་ན། ཁྱོད་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་བྱུང་ཤིག །
en: Great King, for these reasons you should go forth into the well-spoken Dharma-Vinaya.’

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ནས་བཅོམ་ལྡན་འདས་དེས་རྒྱལ་པོ་ཡུལ་ཤིན་ཏུ་རྣམ་པར་དག་པ་རབ་ཏུ་འབྱུང་བ་ཡང་དག་པར་འཛིན་དུ་བཅུག་པས་རྒྱལ་སྲིད་ཐམས་ཅད་སྤངས།
en: “Then, Sāgaramati, as the Blessed One had caused King Pure Domain go forth, the king abandoned his dominion and the glories of his domain.

source: རྒྱལ་སྲིད་ཀྱི་དཔལ་ཡང་སྤངས་ཏེ་ཁྱིམ་ན་གནས་པས་ཡིད་བྱུང་བས་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ཏེ་གོས་ངུར་སྨྲིག་བགོས་ནས།
en: He turned his mind from the household life, shaved his head and facial hair, and donned the saffron-colored robes.

source: བཅོམ་ལྡན་འདས་དེའི་བསྟན་པ་ལ་དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ངོ་། །
en: Leaving his home, he faithfully went forth in the teachings of that blessed one.

source: དེ་རབ་ཏུ་བྱུང་བར་རིག་ནས་རྒྱལ་པོའི་བཙུན་མོའི་འཁོར་ཀྱང་རབ་ཏུ་བྱུང་ངོ་། །དེ་དག་རབ་ཏུ་བྱུང་བར་རིག་ནས་རྒྱལ་བུ་གཞོན་ནུ་རྣམས་ཀྱང་རབ་ཏུ་བྱུང་ངོ་། །དེ་དག་རབ་ཏུ་བྱུང་བར་རིག་ནས་རྒྱལ་པོའི་བུ་མོ་གཞོན་ནུ་མ་རྣམས་ཀྱང་རབ་ཏུ་བྱུང་ངོ་། །
en: Seeing that he had done so, his queens, princes, and princesses also went forth.

source: དེ་དག་རབ་ཏུ་བྱུང་བར་རིག་ནས་རྒྱལ་པོའི་ཡུལ་ན་གནས་པའི་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དགུ་ཡང་རབ་ཏུ་བྱུང་ངོ་། །
en: Seeing that he had done so, ninety-nine trillion beings who lived in the king’s land also went forth.

source: དེ་ལྟར་དེ་དག་རབ་ཏུ་བྱུང་ནས་དགེ་བའི་རྩ་བའི་ཆོས་ཚོལ་བ་ལ་ཡོངས་སུ་བརྩོན་པའི་བརྩོན་འགྲུས་བརྩམས་ཏེ་གནས་སོ། །
en: Once they all had gone forth, they applied great effort in diligently pursuing virtuous qualities.

source: བློ་གྲོས་རྒྱ་མཚོ་སེམས་ཅན་བསོད་ནམས་བྱས་པ་ཐམས་ཅད་ཀྱི་གནས་སུ་གྱུར་པས་ཇི་ཙམ་དུ་བཅོམ་ལྡན་འདས་དེའི་གསུང་རབ་མཛེས་པར་གྱུར་པ་ལ་ལྟོས།
en: “Sāgaramati, consider what a credit to that blessed one’s teachings these beings were as they became firmly grounded in the pursuit of merit.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་ཡུལ་ཤིན་ཏུ་རྣམ་པར་དག་པ་དེ་ལྟར་རབ་ཏུ་བྱུང་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་སྣང་བ་མཐའ་ཡས་དེ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: After the great king Pure Domain went forth, Sāgaramati, he went before the blessed thus-gone Infinite Light and requested of him,

source: བཅོམ་ལྡན་འདས་བདག་གང་ལ་སྒྲུབ་པ་སྙིང་པོར་བགྱིད་པར་གནས་ཤིང་དོན་མཆིས་པར་ཡུལ་འཁོར་གྱི་བསོད་སྙོམས་ཡོངས་སུ་འཚལ་བར་འགྱུར་བའི་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པ་བདག་ལ་སྩལ་དུ་གསོལ།
en: ‘Blessed One, please grant me an instruction and a teaching that will be meaningful and applicable as I go to collect alms in the countryside.’

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་དེས་དགེ་སློང་ཡུལ་ཤིན་ཏུ་རྣམ་པར་དག་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One answered the monk Pure Domain,

source: དགེ་སློང་ཁྱོད་ཀྱི་མིང་ནི་ཡུལ་ཤིན་ཏུ་རྣམ་པར་དག་པ་ཞེས་བྱའོ། །
en: ‘Monk, your name is Pure Domain.

source: ཁྱོད་སོང་ལ་རང་གི་ཡུལ་རྣམ་པར་དག་པར་བྱ་བའི་ཕྱིར་བརྩོན་པར་གྱིས་ཤིག །
en: You should go forth and seek to purify your domain.

source: རང་གི་ཡུལ་ལ་ཚུལ་བཞིན་གྱིས་སོ་སོར་རྟོགས་ཤིག །
en: Realize your domain correctly.

source: ཅི་ནས་ཀྱང་ཡུལ་དྲུག་པོ་དག་གི་ནང་ནས་ཆོས་གང་ཁྱོད་ལ་སྣང་བར་འགྱུར་བ་དེ་ཉིད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡང་དག་པར་རྫོགས་པ་ཁོང་དུ་ཆུད་པས་བྱང་ཆུབ་མཐོང་བར་འགྱུར་བ་དེ་ལྟར་སོ་སོར་རྟོགས་ཤིག །
en: By all means, out of the six sense objects, you must completely master any phenomenon that appears to you, exactly as it is.

source: བྱང་ཆུབ་ལ་རིང་བའི་འདུ་ཤེས་མ་བྱེད་ཅིག །
en: By doing so you will see awakening. You must understand it in this way.

source: ཉེ་བའི་འདུ་ཤེས་ཀྱང་མ་བྱེད་ཅིག །
en: Do not conceive of awakening as something far away or as something nearby.’

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ནས་བཅོམ་ལྡན་འདས་དེས་དགེ་སློང་ཡུལ་ཤིན་ཏུ་རྣམ་པར་དག་པ་ལ་གདམས་ངག་འདིས་གདམས་པ་དང་གཅིག་པུ་དབེན་པར་རྟུན་ཅིང་ཤེས་བཞིན་དང་ལྡན་ལ་བག་ཡོད་པར་གནས་ཏེ་རང་གི་ཡུལ་ལ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་སོ་སོར་རྟོག་གོ། །
en: “Sāgaramati, with this practical instruction given by that blessed one to the monk Pure Domain, he diligently went into solitude and with awareness and carefulness correctly understood his domain.

source: དེའི་ཚུལ་བཞིན་གྱིས་སོ་སོར་རྟོག་པ་གང་ཞེ་ན།
en: What was his correct discrimination?

source: འདི་ལྟ་སྟེ། མིག་གི་ཡུལ་ནི་སྟོང་པ་ཉིད་ཀྱི་ཡུལ་ལོ། །
en: “The domain of the eye is the domain of emptiness.

source: སྟོང་པ་ཉིད་ཀྱི་ཡུལ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡུལ་ལོ། །
en: The domain of emptiness is the domain of all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱང་སྟོང་པ་ཉིད་ཀྱི་ཡུལ་ཏེ་སངས་རྒྱས་ཀྱི་ཡུལ་ལོ། །
en: The domain of all beings and the domain of emptiness are the domain of buddhahood.

source: རྣ་བའི་ཡུལ་ནི་སྟོང་པ་ཉིད་ཀྱི་ཡུལ་ལོ། །
en: The domain of the ear is the domain of emptiness.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱང་སྟོང་པ་ཉིད་ཀྱི་ཡུལ་ཏེ། སངས་རྒྱས་ཀྱི་ཡུལ་ལོ། །
en: The domain of all beings and the domain of emptiness are the domain of buddhahood.

source: དེ་བཞིན་དུ་སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་ཀྱི་ཡུལ་ནི་སྟོང་པ་ཉིད་ཀྱི་ཡུལ་ལོ། །
en: Similarly, the domains of the nose, tongue, body, and mind are the domain of emptiness.

source: མིག་གི་ཡུལ་ནི་མཚན་མ་མེད་པའི་ཡུལ་ལོ། །
en: The domain of the eye is the domain of signlessness.

source: མཚན་མ་མེད་པའི་ཡུལ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡུལ་ལོ། །
en: The domain of signlessness is the domain of all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱང་མཚན་མ་མེད་པའི་ཡུལ་ཏེ་སངས་རྒྱས་ཀྱི་ཡུལ་ལོ། །
en: The domain of all beings and the domain of signlessness are the domain of buddhahood.

source: ཡིད་ཀྱི་བར་གྱི་ཡུལ་ནི་མཚན་མ་མེད་པའི་ཡུལ་ལོ། །
en: The domains of the sense faculties up to and including the mind are the domain of signlessness.

source: དེ་བཞིན་དུ་མིག་གི་ཡུལ་ནི་སྨོན་པ་མེད་པའི་ཡུལ་ལོ། །མངོན་པར་འདུ་བྱ་བ་མེད་པའི་ཡུལ་ལོ། །མ་སྐྱེས་པ་དང་མ་བྱུང་བའི་ཡུལ་ལོ། །
en: Likewise, the domain of the eye is the domain of wishlessness, the unconditioned, the unborn, and non-arising.

source: མ་བྱུང་བའི་ཡུལ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡུལ་ལོ། །
en: The domain of nonarising is the domain of all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱང་མ་བྱུང་བའི་ཡུལ་ཏེ་སངས་རྒྱས་ཀྱི་ཡུལ་ལོ། །
en: The domain of all beings and the domain of non-arising are the domain of buddhahood.

source: དེ་བཞིན་དུ་ཡིད་ཀྱི་བར་གྱི་ཡུལ་དང་སྦྱར་རོ། །
en: The same should be applied to the domains up to and including that of the mind.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལྟར་དགེ་སློང་ཡུལ་ཤིན་ཏུ་རྣམ་པར་དག་པ་ཡུལ་ལ་འཇུག་པ་འདིས་ལུས་དང་སེམས་ལས་སུ་རུང་སྟེ་
en: “By understanding his domains in this way, Sāgaramati, the monk Pure Domain achieved physical and mental pliancy.

source: འདུན་པ་དང་བརྩོན་འགྲུས་དང་སེམས་དང་། དཔྱོད་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་བསྒོམས་པས་རིང་པོ་མ་ཐོགས་པར་མངོན་པར་ཤེས་པ་ལྔ་བསྐྱེད་པར་གྱུར་ཏོ། །
en: Thus he cultivated the bases of miracles concerning motivation, diligence, conscientiousness, and analysis, and before long he developed the five super-knowledges.

source: བག་ཡོད་པའི་སྤྱོད་པ་དེས་ཀྱང་དོན་དང་ངེས་པར་བྱུང་བའི་ཚིག་ཐམས་ཅད་སྡུད་པ་ཞེས་བྱ་བའི་གཟུངས་རབ་ཏུ་ཐོབ་པོ། །
en: Through such careful conduct, he attained the dhāraṇī called ‘amassing the meaning and all manifest words.’

source: བློ་གྲོས་རྒྱ་མཚོ་དེའི་ཚེ་དེའི་དུས་ན་གང་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་སྲིད་འབྱོར་པ་སྤངས་ཏེ་བཅོམ་ལྡན་འདས་དེའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཡུལ་ཤིན་ཏུ་རྣམ་པར་དག་པ་ཞེས་བྱ་བའི་དགེ་སློང་དུ་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་ཁྱོད་དོགས་ཤིང་ཡིད་གཉིས་སུ་གྱུར་ཏམ་ཐེ་ཚོམ་ཟ་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟའོ། །
en: Sāgaramati, if you are wondering, doubting, or of two minds about whether he, who was then the monk called Pure Domain, who renounced the wealth and dominion of a universal monarch and went forth in the teachings of the Blessed One, is somebody unknown to you, do not think any further.

source: བློ་གྲོས་རྒྱ་མཚོ་ཁྱོད་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་དགེ་སློང་ཡུལ་ཤིན་ཏུ་རྣམ་པར་དག་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: Because, Sāgaramati, you were at that time the monk Pure Domain!

source: བློ་གྲོས་རྒྱ་མཚོ་དེའི་ཚེ་དེའི་དུས་ན་གང་དག་དགེ་སློང་རབ་ཏུ་བྱུང་བ་དེའི་རྗེས་སུ་རབ་ཏུ་བྱུང་བའི་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོར་གྱུར་པ་དེ་དག་གཞན་དག་ཅིག་ཡིན་པ་སྙམ་དུ་ཁྱོད་སེམས་ན། དེ་དེ་ལྟར་མི་བལྟ་སྟེ།
en: Sāgaramati, if you are thinking that the many trillions of beings who followed him into going forth might be someone else, think no further.

source: ཆོས་མཉན་པའི་ཕྱིར་གང་དག་ཁྱོད་ཀྱི་ཕྱི་བཞིན་འབྲང་བའི་བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་གོ། །
en: They are these bodhisattvas who have followed you to hear the Dharma.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་སྔོན་བྱུང་བའི་ལེའུ་འདི་བཤད་པ་ན་སྲོག་ཆགས་ཁྲི་བརྒྱད་སྟོང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་བརྒྱད་སྟོང་གིས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: After the Blessed One had told this tale from the past, eighty million beings developed the mind directed toward unsurpassed and perfect awakening, and eight thousand bodhisattvas attained the acceptance that phenomena are unborn.

source: སྔོན་བྱུང་བའི་ལེའུ་ཞེས་བྱ་སྟེ་བཅུ་པའོ།། །།
en: [Chapter Ten: A Tale of What Came Before]

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོ་ལ་བཀའ་སྩལ་པ།
en: Then the Blessed One said to Sāgaramati,

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལྟ་བས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མྱུར་དུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྐྱེས་བུ་དམ་པ་ཁྱོད་ཀྱི་རྗེས་སུ་བསླབ་པར་བྱ་སྟེ
en: “Therefore, Sāgaramati, bodhisattva great beings who wish to swiftly and fully awaken to unsurpassed and perfect buddhahood should follow your training, sublime being.

source: བྱང་ཆུབ་སེམས་དཔས་ཚིག་ཏུ་བྱས་ཤིང་ཚིག་ལྷུར་བླང་བར་མི་བྱའི་བྱང་ཆུབ་སེམས་དཔས་ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་དུ་བྱའོ། །
en: Bodhisattvas should not be verbose and obsessed with the use of words; rather, they should practice what they preach.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་དུ་བྱེད་པ་ཡིན་ཞེ་ན།
en: How do bodhisattvas practice what they preach, you ask?

source: བློ་གྲོས་རྒྱ་མཚོ་སངས་རྒྱས་སུ་འགྱུར་བར་བྱའོ་ཞེས་བྱ་བའི་ཚིག་འདི་ནི་བརྗོད་པར་སླའི། དགེ་བ་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་བསྒྲུབ་པ་ནི་དཀའོ་སྙམ་པའོ། །
en: Sāgaramati, they do so by appreciating how easy it is to say, ‘I am going to become a buddha,’ yet how hard it is to actually accomplish the virtues of the factors of awakening.

source: བློ་གྲོས་རྒྱ་མཚོ་བྱང་ཆུབ་སེམས་དཔའ་གང་ལ་ལས་ཆོས་ཀྱི་སྦྱིན་པས་སེམས་ཅན་ཐམས་ཅད་མགྲོན་དུ་གཉེར་ཏེ།
en: Sāgaramati, any bodhisattva who regales beings with the gift of Dharma, announcing to them,

source: ཁོ་བོས་སེམས་ཅན་ཁྱེད་ཆོས་ཀྱི་སྦྱིན་པས་ཚིམ་པར་བྱའོ་ཞེས་བྱས་ལ་མང་དུ་ཐོས་པ་དང་། དེ་ལས་གཞན་པ་དགེ་བ་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ལ་ཡང་བརྩོན་པར་མི་བྱེད་ན་དེ་སེམས་ཅན་དེ་དག་ལ་སླུ་བ་ཡིན་ཏེ
en: ‘You will be satisfied by my gift of Dharma,’ and then teaches them extensively, but himself acts otherwise, failing to strive toward the virtues of the factors of awakening, has let those beings down.

source: དེ་ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་བྱེད་པ་མ་ཡིན་ནོ། །
en: He has not practiced what he preached.

source: བློ་གྲོས་རྒྱ་མཚོ་གང་གི་ཚེ་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཀྱི་སྦྱིན་པས་སེམས་ཅན་ཐམས་ཅད་མགྲོན་དུ་གཉེར་ཏེ་ཁོ་བོས་སེམས་ཅན་ཁྱོད་ཆོས་ཀྱི་སྦྱིན་པས་ཚིམ་པར་བྱའོ་ཞེས་བྱས་ལ་མང་དུ་ཐོས་པ་དང་། དེ་ལས་གཞན་པ་དགེ་བ་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ལ་ཡང་བརྩོན་པར་བྱེད་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔས་ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་བྱེད་པ་ཡིན་ནོ། །
en: However, Sāgaramati, when he regales everyone with the gift of the factors of awakening, announcing to them, ‘You will be satisfied by my gift of Dharma,’ and then teaches them extensively and himself strives toward the virtues of the factors of awakening, then he has practiced what he preached.

source: བློ་གྲོས་རྒྱ་མཚོ་འདི་ལྟ་སྟེ་དཔེར་ན། རྒྱལ་པོའམ་རྒྱལ་པོའི་བློན་པོས་གྲོང་ཁྱེར་གྱི་སྐྱེ་བོ་ཐམས་ཅད་ལ་སང་ཟན་སྦྱིན་ནོ་ཞེས་མགྲོན་དུ་བོས་ལ་ཡལ་བར་བོར་ཏེ། བཟའ་བ་དང་བཏུང་བ་མ་སྦྱར་ན་དེས་སྐྱེ་བོའི་ཚོགས་དེ་ཐམས་ཅད་བསླུས་པ་ཡིན་ཏེ།
en: “Sāgaramati, to draw an analogy, if a king or a royal minister were to announce to all the people of a city that he will distribute supplies to them the following day, and then abandons them, giving them no food or drink, then he has let that group of people down.

source: དེ་དག་ཀྱང་བཟའ་བ་དང་། བཏུང་བའི་ཟས་མ་ཐོབ་པས་འཕྱ་ཞིང་སླར་འོང་བ་
en: Because they did not receive any food or drink, they will in turn deride him.

source: དེ་བཞིན་དུ། བློ་གྲོས་རྒྱ་མཚོ་བྱང་ཆུབ་སེམས་དཔས་མ་རྒལ་བ་བསྒྲལ་བ་དང་། མ་གྲོལ་བ་དགྲོལ་བ་དང་། དབུགས་མ་ཕྱིན་པ་དབུགས་དབྱུང་བ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་མ་འདས་པ་ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བའི་ཕྱིར་སེམས་ཅན་ཐམས་ཅད་དབུགས་ཕྱུང་ལ་མང་དུ་ཐོས་པ་དང་། དེ་ལས་གཞན་པའི་དགེ་བ་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ལ་ཡང་བརྩོན་པར་མི་བྱེད་ནབྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་བྱེད་པ་མ་ཡིན་ཏེ།
en: Analogously, Sāgaramati, if a bodhisattva teaches extensively about finding relief in order to emancipate all beings who have not yet gone beyond, liberate those who have not yet been liberated, offer relief to those who have not found relief, and bring to parinirvāṇa those who have not yet reached parinirvāṇa, yet himself fails to strive toward the virtues of the factors of awakening, then that bodhisattva has not practiced what he preached.

source: ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་ལ་སླུ་བ་ཡིན་ནོ། །
en: He has let the world and its gods down.

source: དེ་ལྟ་བུ་དེ་སྔོན་སངས་རྒྱས་མཐོང་བའི་ལྷ་རྣམས་ཀྱིས་མཐོང་ན་འཕྱ་ཞིང་གཞོགས་འཕྱས་བྱེད་ལ་རྣམ་པར་སྨོད་དེ།
en: If the gods who have previously beheld buddhas see him, they will deride, disparage, and belittle him.

source: གང་དག་མཆོད་སྦྱིན་བྱ་བར་དམ་བཅས་པ་ཉམས་འོག་ཏུ་ཆུད་པར་བྱེད་པའི་མཆོད་སྦྱིན་གྱི་བདག་པོ་བྱེད་པ་དེ་དག་ནི་དཀོན་ནོ། །
en: Those who pledge to perform offerings and actually go on to perform such offerings are rare.

source: དེ་བས་ཀྱང་གང་དག་མཆོད་སྦྱིན་ཆེན་པོ་དེ་བརྩམས་ནས་བླ་ན་མེད་པའི་ཐེག་པ་ཆེན་པོ་ལ་ཡོངས་སུ་སྐྱོ་བར་མི་འགྱུར་བ་དག་ནི་ཆེས་དཀོན་ནོ། །
en: Still, compared to them, those who begin with the great offerings and remain undiscouraged by the unsurpassed Great Vehicle are even more rare.

source: བློ་གྲོས་རྒྱ་མཚོ་བྱང་ཆུབ་སེམས་དཔས་གང་གིས་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ལ་སླུ་བར་འགྱུར་བའི་ཚིག་བརྗོད་པར་མི་བྱའོ། །
en: Sāgaramati, a bodhisattva must not make any claims that will let the world and its gods, humans, and asuras down.

source: བློ་གྲོས་རྒྱ་མཚོ་གཞན་ཡང་ལ་ལ་ཞིག་གིས་བྱང་ཆུབ་སེམས་དཔའ་གང་ལ་ཆོས་ཀྱི་དོན་བྱ་བར་གསོལ་བ་བཏབ་ལ། དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཁོ་བོས་ཁྱེད་ཀྱི་ཆོས་ཀྱི་དོན་འདི་ཡོངས་སུ་ཐོབ་པར་བྱའོ་ཞེས་ཚིག་སྨྲས་པར་གྱུར་ནབྱང་ཆུབ་སེམས་དཔས་དེ་ལ་ལུས་ནི་ཡོངས་སུ་གཏང་བར་བྱའི་སེམས་ཅན་སླུ་བར་ནི་མི་བྱའོ། །
en: “Moreover, Sāgaramati, if someone requests religious wealth from a bodhisattva, and that bodhisattva claims, ‘You will receive your religious wealth from me,’ then that bodhisattva must not let the other person down, even at the cost of his life.

source: བློ་གྲོས་རྒྱ་མཚོ་ཁྱོད་ཀྱིས་རྣམ་གྲངས་འདིས་ཀྱང་འདི་ལྟར་རིག་པར་བྱའོ། །
en: Sāgaramati, that is how you should understand this lesson.

source: བློ་གྲོས་རྒྱ་མཚོ་སྔོན་བྱུང་བའི་འདས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པའི་ཡང་ཆེས་གྲངས་མེད་དཔག་ཏུ་མེད་པར་གྱུར་པ་དེའི་ཚེ་དེའི་དུས་ན།
en: “Sāgaramati, countless, unfathomable, innumerable eons ago lived a lion king named Silky White Mane and Perfect Limbs.

source: སེང་གེའི་རྒྱལ་པོ་དར་དཀར་ལྟ་བུའི་རལ་པ་ཅན་ཡན་ལག་མ་སྨད་པ་ཞེས་བྱ་བ་སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པའི་རྗེས་སུ་ཞུགས་པ་རྩ་བ་དང་ལོ་མ་དང་མེ་ཏོག་དང་འབྲས་བུ་ལ་མོས་པ་ཞིག་རིའི་ཕུག་བགྲོད་དཀའ་བ་ཞིག་ན་གནས་སོ། །
en: He was steeped in love for all beings, and only cared to eat roots, leaves, flowers, and fruits.

source: རི་ཕུག་བགྲོད་དཀའ་བ་དེ་ན་སྤྲེའུ་ཕོ་མོ་གཉིས་ཤིག་ཀྱང་གནས་སོ། །
en: He lived in an inaccessible mountain hollow, where a male and female monkey couple also lived.

source: དེ་ནས་དུས་གཞན་ཞིག་ན་སྤྲེའུ་མོ་དེ་ལ་བུ་འབྲངས་ནས་དེ་ལས་ཕྲུ་གུ་གཉིས་བྱུང་ངོ་། །
en: Then one time, two children were born to the female monkey.

source: དེ་ནས་སྤྲེའུ་དེ་དང་སྤྲེའུ་མོ་དེས་ཕྲུ་གུ་དེ་གཉིས་རི་དགས་ཀྱི་རྒྱལ་པོ་སེང་གེ་ལ་བཏམས་ཏེ་སྤྱོད་ཡུལ་དུ་དོང་ངོ་། །
en: The monkey parents brought their two infants before the lion, king of beasts, to speak with him.

source: དེ་ནས་བྱ་རྒོད་ཀྱི་རྒྱལ་པོ་སྤུ་གྲི་བ་ཞེས་བྱ་བ་སྟེང་གི་བར་སྣང་ལས་བབས་ཏེ་སྤྲེའུའི་ཕྲུ་གུ་དེ་གཉིས་བླངས་ནས་སྟེང་གི་བར་སྣང་ལ་གནས་པར་གྱུར་པ་དང་། རི་དགས་ཀྱི་རྒྱལ་པོ་སེང་གེས་བྱ་རྒོད་ཀྱི་རྒྱལ་པོ་སྤུ་གྲི་བས་སྤྲེའུའི་ཕྲུ་གུ་དེ་གཉིས་ཁྱེར་བ་མཐོང་ངོ་། །
en: At that point, the vulture king Razor swept down out of the sky and carried the two monkey babies back up into the sky. The lion, king of beasts, saw the vulture king Razor carrying off the two monkey cubs.

source: མཐོང་ནས་ཀྱང་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: Upon seeing this, he exclaimed in verse,

source: བྱ་རྒོད་རྒྱལ་པོ་ཁྱོད་ལ་བདག་གསོལ་བ། །
en: “ ‘Vulture King, I implore you:

source: བདག་གི་སྤྲེའུའི་ཕྲུ་གུ་དེ་གཉིས་ཁྱེད་ཀྱིས་ཐོང་། །
en: Release my monkeys’ babies!

source: བདག་ནི་དེ་དག་འཇིགས་མེད་བྱ་ཕྱིར་གནས། །
en: I live to keep them from fear.

source: སྐྱབས་སུ་དོང་བ་མ་གསད་ཁྱེད་ཀྱིས་ཐོང་། །
en: I have protected them and will not kill them, so release them!’

source: དེ་ནས་བྱ་རྒོད་ཀྱི་རྒྱལ་པོས་རི་དགས་ཀྱི་རྒྱལ་པོ་སེང་གེ་དེ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: “Then the vulture king spoke the following verse to the lion, king of beasts:

source: རི་དགས་རྒྱལ་པོ་གལ་ཏེ་ཁྱོད་ནི་བདག་འདོར་ན། །དེ་ལྟར་ན་ནི་འདི་གཉིས་མི་གསད་གཏང་བར་བྱ། །
en: “ ‘King of beasts, if you give up your life, I will release these two alive.

source: ཁོ་བོས་འདི་གཉིས་ཟོས་ནས་ཁོ་བོ་མཁའ་ལ་གནས། །
en: I could eat these two while hovering in the sky.
